package conv

import (
	"testing"

	"github.com/stretchr/testify/assert"
)

func TestEncode(t *testing.T) {
	as := assert.New(t)

	data := []struct {
		in     string
		expect string
	}{
		{expect: "柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿柿柿杮柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿柿杮柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿柿杮杮柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿杮柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿杮柿杮柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿杮杮柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿杮杮杮", in: "abcdefg"},
		{expect: "柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿柿柿柿杮柿柿柿杮杮柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿柿柿杮柿柿杮柿柿杮杮柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿柿柿柿杮柿杮柿柿杮杮", in: "うんこ"},
		{expect: "柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿柿柿柿杮柿柿柿柿杮柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿柿柿柿杮柿柿柿杮柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿柿柿柿杮柿柿柿杮杮柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿柿柿柿杮柿柿杮柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿柿杮杮柿柿柿柿柿杮柿柿杮柿杮柿", in: "あいうえお"},
	}

	for _, v := range data {
		as.Equal(v.expect, Encode(v.in))
	}
}
